// 1. Программа должна быть разработана в виде консольного приложения на языке С#.
// 2. Создать объекты классов «Прямоугольник», «Квадрат», «Круг».
// 3. Для реализации возможности сортировки геометрических фигур для
// класса
// «Геометрическая фигура» добавить реализацию интерфейса
// IComparable. Сортировка производится по площади фигуры.
// 4. Создать коллекцию класса ArrayList. Сохранить объекты в коллекцию.
// Отсортировать коллекцию. Вывести в цикле содержимое коллекции.
// 5. Создать коллекцию класса List<Figure>. Сохранить объекты в
// коллекцию. Отсортировать коллекцию. Вывести в цикле содержимое коллекции.
// 6. Модифицировать класс разреженной матрицы (проект SparseMatrix) для работы с тремя измерениями - х,у,. Вывод элементов в методе
// ToStringO осуществлять в том виде, который Вы считаете наиболее удобным. Разработать пример использования разреженной матрицы для геометрических фигур.
// 7. Реализовать класс «SimpleStack» на основе односвязного списка. Класс
// SimpleStack
// наследуется от класса SimpleList (проект
// SimpleListProject). Необходимо добавить в класс методы:
// • public void Push(T element) - добавление в стек;
// • public T Pop( - чтение с удалением из стека.
// 8. Пример работы класса SimpleStack реализовать на основе
// геометрических фигур.
fn main() {
    
}